[
  {
    "id": "STYLE-001",
    "title": "Set up design system CSS variables for BioRunway color palette",
    "description": "Create CSS custom properties for the color system extracted from Figma: Au Chico palette (#fbf5f5, #f0dbdb, #a5555b, #66353d, #371a1e), Porsche palette (#f8f0dc, #f0deb8, #e7c78a, #dca75c, #d48f3b, #a45e2a, #391f11), and Cod Gray (#f7f7f6). Set up typography system for PP Pangaia and Inter fonts.",
    "priority": "high",
    "status": "completed",
    "sequence": 1,
    "tags": ["design-system", "css", "colors", "typography", "foundation"]
  },
  {
    "id": "STYLE-002", 
    "title": "Convert Figma gradient backgrounds to reusable CSS",
    "description": "Replace inline SVG gradients with proper CSS radial gradients. Create reusable gradient utility classes for the white fade patterns used in section backgrounds.",
    "priority": "high",
    "status": "completed",
    "sequence": 2,
    "tags": ["gradients", "css", "backgrounds", "utilities"]
  },
  {
    "id": "IA-001",
    "title": "Update navigation to simplified structure", 
    "description": "Consolidate navigation from 4 items (Home, Articles, About, Contact) to 3 items (Home, Articles, Sign Up). Update Header component with new navigation structure and styling to match Figma design with proper logo positioning and transparent overlay on hero.",
    "priority": "high",
    "status": "completed",
    "sequence": 3,
    "tags": ["navigation", "ia", "header", "design"]
  },
  {
    "id": "IA-002",
    "title": "Create Hero section with email signup integration",
    "description": "Build hero section with dark background (#371a1e), centered content layout, headline styling (PP Pangaia Light Italic 48px), and integrated email signup form with backdrop blur effect matching Figma design exactly.",
    "priority": "high",
    "status": "completed", 
    "sequence": 4,
    "tags": ["hero", "email-signup", "backdrop-blur", "typography"]
  },
  {
    "id": "IA-003",
    "title": "Create About section components with proper image handling",
    "description": "Build 'The Impact of Biotech' and 'Weaving the Future' sections with alternating image/text layout. Implement proper image positioning, rounded corners (80px), shadows, and responsive two-column layout matching Figma spacing and typography. COMPLETED with exact Figma match, real images, responsive design, and professional styling.",
    "priority": "high",
    "status": "completed",
    "sequence": 5, 
    "tags": ["about", "images", "layout", "responsive", "shadows", "figma-exact"]
  },
  {
    "id": "IA-004",
    "title": "Create Latest Articles grid section",
    "description": "Build 3-column articles grid with image backgrounds, proper image cropping and positioning, rounded corners (20px), card shadows, and responsive layout. Include 'See All Articles' button with border styling. COMPLETED with single-column stacked layout matching Figma exactly: #FFFCF6 background, Au Chico borders, Porsche color cards, specific article titles, and proper button styling with Porsche-400 border.",
    "priority": "high",
    "status": "completed",
    "sequence": 6,
    "tags": ["articles", "grid", "cards", "images", "responsive", "design-system", "figma-exact"]
  },
  {
    "id": "IA-005",
    "title": "Create Founders showcase section",
    "description": "Build founders section with 4-column grid layout (including Taryn Stark), placeholder image backgrounds (#e7c78a), proper card styling with borders, and responsive design for mobile/tablet. COMPLETED with 4-column responsive grid, Taryn Stark and 3 other founders, porsche color placeholder backgrounds, proper card styling with 20px rounded corners, hover effects, and responsive breakpoints.",
    "priority": "medium",
    "status": "completed",
    "sequence": 7,
    "tags": ["founders", "team", "grid", "responsive", "cards", "design-system"]
  },
  {
    "id": "IA-006", 
    "title": "Create Advisory Board section",
    "description": "Build advisory board section with 2-column grid layout, differentiated background color (#f0deb8), smaller typography (24px heading vs 32px), and proper spacing below founders section. COMPLETED with 2-column layout, Au-Chico-700 heading color, real names (José Miguel Laplaza PhD, Evelyn Rynkiewicz), gray placeholder images, and shared radial gradient background with Founders section.",
    "priority": "medium",
    "status": "completed",
    "sequence": 8,
    "tags": ["advisory", "team", "grid", "responsive", "figma-exact"]
  },
  {
    "id": "IA-007",
    "title": "Create Newsletter CTA section with background image",
    "description": "Build 'Become an Insider' section with background image, backdrop blur form, centered layout, and integrated email signup matching the hero form styling but with different background treatment. COMPLETED with 'Become an Insider' heading, background image, backdrop blur form component, porsche color styling, and proper integration replacing old Newsletter section.",
    "priority": "medium",
    "status": "completed",
    "sequence": 9,
    "tags": ["newsletter", "cta", "background-image", "signup", "figma-exact"]
  },
  {
    "id": "IA-008",
    "title": "Create Footer with multi-column contact layout", 
    "description": "Build footer with logo section, navigation columns (Explore, Follow Us, Contact), proper contact email organization, and dark background (#66353d) matching Figma design exactly. COMPLETED with logo section, Explore/Follow Us/Contact columns, proper email organization, hover effects, and Au-Chico-900 dark background.",
    "priority": "medium",
    "status": "completed",
    "sequence": 10,
    "tags": ["footer", "contact", "layout", "social", "figma-exact"]
  },
  {
    "id": "RESPONSIVE-001",
    "title": "Implement mobile breakpoints across all sections",
    "description": "Add mobile responsive design for all sections: hero content stacking, single-column layouts for about sections, article grid responsive behavior, founders/advisory responsive grids, and proper mobile navigation. COMPLETED with standardized mobile padding (32px mobile, 40px desktop), reduced vertical spacing, consistent responsive grid patterns, and proper About section alignment.",
    "priority": "high",
    "status": "completed",
    "sequence": 11,
    "tags": ["mobile", "responsive", "breakpoints", "accessibility", "figma-exact"]
  },
  {
    "id": "CLEANUP-001",
    "title": "Remove unused About and Contact page components",
    "description": "Clean up codebase by removing About.astro and Contact.astro components, update routing, and ensure no broken links remain after homepage consolidation.",
    "priority": "low",
    "status": "backlog",
    "sequence": 12,
    "tags": ["cleanup", "routing", "maintenance"]
  },
  {
    "id": "EMAIL-001",
    "title": "Style email signup forms to match Figma design",
    "description": "Update EmailSignup component with backdrop blur effect, proper border styling (#a5555b for hero, #d3999a for newsletter), button styling, and form validation states.",
    "priority": "medium",
    "status": "backlog",
    "sequence": 13,
    "tags": ["email", "forms", "styling", "validation"]
  },
  {
    "id": "EMAIL-002", 
    "title": "Re-enable RLS with proper public insert policy",
    "description": "Supabase RLS was disabled for testing. Create proper Row Level Security policy that allows public inserts to the General Email List table while maintaining security.",
    "priority": "low",
    "status": "backlog",
    "sequence": 14,
    "tags": ["security", "supabase", "database"]
  },
  {
    "id": "EMAIL-003",
    "title": "Add exception handling for duplicate email addresses", 
    "description": "Add proper error handling to show user-friendly message when email already exists in database, with proper styling for error states.",
    "priority": "low", 
    "status": "backlog",
    "sequence": 15,
    "tags": ["error-handling", "ux", "validation"]
  },
  {
    "id": "TECH-001",
    "title": "Consolidate design system to Tailwind theme configuration",
    "description": "Migrate color system, typography, and spacing from CSS custom properties to proper Tailwind theme config. Upgrade to latest Tailwind CSS v4 features, create custom font family classes, and consolidate all design tokens into a unified system.",
    "priority": "medium",
    "status": "backlog", 
    "sequence": 16,
    "tags": ["tailwind", "design-system", "refactor", "upgrade", "fonts", "colors"]
  },
  {
    "id": "CONTENT-001",
    "title": "Add real images to Latest Articles cards",
    "description": "Replace placeholder images (placehold.co) with actual article images for: 'The Who, What, Why of BioRunway', 'Biodyes 101', and 'Knowledge Hub: Glossary of terms'. Ensure images are optimized for web, properly sized (683x368, 750x750, 1024x1024 respectively), and placed in public/images/articles/ directory.",
    "priority": "medium",
    "status": "backlog",
    "sequence": 17,
    "tags": ["content", "images", "articles", "optimization"]
  },
  {
    "id": "TECH-002", 
    "title": "Simplify URL routing to remove base path configuration",
    "description": "Remove the complex base URL handling (BASE_URL environment variable) throughout the codebase to avoid conflicts with other Astro projects. Update all image references, links, and routing to use simple relative paths. This will eliminate the need for base path configuration and simplify deployment. COMPLETED: Removed BASE_URL usage from all components, updated Astro config to remove base path, simplified all routing to use relative paths.",
    "priority": "high",
    "status": "completed",
    "sequence": 18,
    "tags": ["routing", "simplification", "deployment", "configuration", "refactor"]
  },
  {
    "id": "EMAIL-004",
    "title": "Improve email signup success message styling and messaging",
    "description": "Update success message for email signup forms (both hero and newsletter) to provide better user feedback with improved styling, clearer messaging, and consistent design across both forms. Consider adding checkmark icon and better color contrast.",
    "priority": "low",
    "status": "backlog",
    "sequence": 19,
    "tags": ["email", "ux", "messaging", "styling", "forms"]
  },
  {
    "id": "CONTENT-002",
    "title": "Replace placeholder images with high-resolution assets",
    "description": "Replace all placeholder images throughout the site with high-resolution, optimized assets. Includes: hero background, pre-footer background, article images, founder photos, About section images, and any other placeholder content. Ensure images are web-optimized (WebP format when possible) and properly sized for responsive breakpoints.",
    "priority": "medium",
    "status": "backlog",
    "sequence": 20,
    "tags": ["content", "images", "optimization", "assets", "high-resolution"]
  },
  {
    "id": "DESIGN-001",
    "title": "Standardize spacing and layout patterns across components",
    "description": "Create consistent design patterns for section layout, spacing, and responsive behavior. Establish standard container patterns, padding systems, and grid layouts that can be reused across all sections to reduce complexity and ensure consistency. Consider creating utility classes or standardized component templates.",
    "priority": "medium",
    "status": "backlog",
    "sequence": 21,
    "tags": ["design-system", "standardization", "layout", "spacing", "patterns", "maintainability"]
  },
  {
    "id": "ARTICLES-001",
    "title": "Simplify Articles landing page and remove filtering complexity",
    "description": "Drastically simplify the Articles landing page to match new Figma design. Remove complex category filtering system, replace with simple 3-column article grid. Clean up unused imports, remove double footer, and remove Sign Up navigation link that doesn't point anywhere. COMPLETED: Simplified to hero section + 3 article cards + newsletter CTA, removed all filtering logic and unused code.",
    "priority": "high",
    "status": "completed",
    "sequence": 22,
    "tags": ["articles", "simplification", "cleanup", "figma-design", "navigation", "code-optimization"]
  },
  {
    "id": "NAV-001",
    "title": "Implement professional SVG logos and fix navigation issues",
    "description": "Replace inline SVG logos with professional SVG files, implement contextual logo variants (light/dark), fix double footer issues, and implement new mobile navigation design. COMPLETED: Added light/dark logo variants, fixed article page navigation colors, eliminated double footers, created full-screen mobile overlay with proper positioning and interactions.",
    "priority": "high",
    "status": "completed",
    "sequence": 23,
    "tags": ["navigation", "logos", "mobile", "design-system", "cleanup", "accessibility"]
  },
  {
    "id": "ANIMATION-001",
    "title": "Add Framer Motion animations throughout the site",
    "description": "Implement smooth animations and transitions using Framer Motion across all pages. Include page load animations, mobile navigation open/close transitions, hover states, scroll-triggered animations for sections, and smooth page transitions. Focus on enhancing user experience with professional, performant animations that match the brand aesthetic.",
    "priority": "medium",
    "status": "backlog",
    "sequence": 24,
    "tags": ["animation", "framer-motion", "ux", "interactions", "performance", "mobile", "navigation"]
  }
]